longpth/HTTP_ESP8266AVRISP/src/ESP8266AVRISPWebServer.cpp
/*
AVR ISP Programming over HTTP for ESP8266
Copyright (c) Long Pham <it.farmer.vn@gmail.com>

Original version:
	AVR In-System Programming over WiFi for ESP8266
	Copyright (c) Kiril Zyapkov <kiril@robotev.com>

    ArduinoISP version 04m3
    Copyright (c) 2008-2011 Randall Bohn
    If you require a license, see
        http://www.opensource.org/licenses/bsd-license.php
*/
#include "ESP8266AVRISPWebServer.h"
#include <Arduino.h>
#include <SPI.h>
#include <pgmspace.h>
#include <ESP8266WiFi.h>
#include <map>

#include "httpcommand.h"

extern "C" {
    #include "user_interface.h"
    #include "mem.h"
}

#define malloc      os_malloc
#define free        os_free

// #define AVRISP_DEBUG(fmt, ...)     os_printf("[AVRP] " fmt "\r\n", ##__VA_ARGS__ )
#define AVRISP_DEBUG(...)

#define AVRISP_HWVER 2
#define AVRISP_SWMAJ 1
#define AVRISP_SWMIN 18
#define AVRISP_PTIME 10

#define EECHUNK (32)

#define beget16(addr) (*addr * 256 + *(addr+1))

#define HTTP_ESPAVRISP_DEBUG

#ifdef HTTP_ESPAVRISP_DEBUG
std::map<uint8_t, char*> cmd_debug =
{
	{ Cmnd_STK_GET_SYNC         , "Cmnd_STK_GET_SYNC       " },
	{ Cmnd_STK_GET_SIGN_ON      , "Cmnd_STK_GET_SIGN_ON    " },
	{ Cmnd_STK_RESET            , "Cmnd_STK_RESET          " },
	{ Cmnd_STK_SINGLE_CLOCK     , "Cmnd_STK_SINGLE_CLOCK   " },
	{ Cmnd_STK_STORE_PARAMETERS , "Cmnd_STK_STORE_PARAMETER" },
	{ Cmnd_STK_SET_PARAMETER    , "Cmnd_STK_SET_PARAMETER  " },
	{ Cmnd_STK_GET_PARAMETER    , "Cmnd_STK_GET_PARAMETER  " },
	{ Cmnd_STK_SET_DEVICE       , "Cmnd_STK_SET_DEVICE     " },
	{ Cmnd_STK_GET_DEVICE       , "Cmnd_STK_GET_DEVICE     " },
	{ Cmnd_STK_GET_STATUS       , "Cmnd_STK_GET_STATUS     " },
	{ Cmnd_STK_SET_DEVICE_EXT   , "Cmnd_STK_SET_DEVICE_EXT " },
	{ Cmnd_STK_ENTER_PROGMODE   , "Cmnd_STK_ENTER_PROGMODE " },
	{ Cmnd_STK_LEAVE_PROGMODE   , "Cmnd_STK_LEAVE_PROGMODE " },
	{ Cmnd_STK_CHIP_ERASE       , "Cmnd_STK_CHIP_ERASE     " },
	{ Cmnd_STK_CHECK_AUTOINC    , "Cmnd_STK_CHECK_AUTOINC  " },
	{ Cmnd_STK_CHECK_DEVICE     , "Cmnd_STK_CHECK_DEVICE   " },
	{ Cmnd_STK_LOAD_ADDRESS     , "Cmnd_STK_LOAD_ADDRESS   " },
	{ Cmnd_STK_UNIVERSAL        , "Cmnd_STK_UNIVERSAL      " },
	{ Cmnd_STK_PROG_FLASH       , "Cmnd_STK_PROG_FLASH     " },
	{ Cmnd_STK_PROG_DATA        , "Cmnd_STK_PROG_DATA      " },
	{ Cmnd_STK_PROG_FUSE        , "Cmnd_STK_PROG_FUSE      " },
	{ Cmnd_STK_PROG_LOCK        , "Cmnd_STK_PROG_LOCK      " },
	{ Cmnd_STK_PROG_PAGE        , "Cmnd_STK_PROG_PAGE      " },
	{ Cmnd_STK_PROG_FUSE_EXT    , "Cmnd_STK_PROG_FUSE_EXT  " },
	{ Cmnd_STK_READ_FLASH       , "Cmnd_STK_READ_FLASH     " },
	{ Cmnd_STK_READ_DATA        , "Cmnd_STK_READ_DATA      " },
	{ Cmnd_STK_READ_FUSE        , "Cmnd_STK_READ_FUSE      " },
	{ Cmnd_STK_READ_LOCK        , "Cmnd_STK_READ_LOCK      " },
	{ Cmnd_STK_READ_PAGE        , "Cmnd_STK_READ_PAGE      " },
	{ Cmnd_STK_READ_SIGN        , "Cmnd_STK_READ_SIGN      " },
	{ Cmnd_STK_READ_OSCCAL      , "Cmnd_STK_READ_OSCCAL    " },
	{ Cmnd_STK_READ_FUSE_EXT    , "Cmnd_STK_READ_FUSE_EXT  " },
	{ Cmnd_STK_READ_OSCCAL_EXT  , "Cmnd_STK_READ_OSCCAL_EXT" }
};
#endif

static char* readBytesWithTimeout2(WiFiClient& client, size_t maxLength, size_t& dataLength, int timeout_ms)
{
  char *buf = nullptr;
  dataLength = 0;
  while (dataLength < maxLength) {
    int tries = timeout_ms;
    size_t newLength;
    while (!(newLength = client.available()) && tries--) delay(1);
    if (!newLength) {
      break;
    }
    if (!buf) {
      buf = (char *) malloc(newLength + 1);
      if (!buf) {
        return nullptr;
      }
    }
    else {
      char* newBuf = (char *) realloc(buf, dataLength + newLength + 1);
      if (!newBuf) {
        free(buf);
        return nullptr;
      }
      buf = newBuf;
    }
    client.readBytes(buf + dataLength, newLength);
    dataLength += newLength;
    buf[dataLength] = '\0';
  }
  return buf;
}


ESP8266AVRISPWebServer::ESP8266AVRISPWebServer(IPAddress addr, int port, uint8_t reset_pin, uint32_t spi_freq, bool reset_state, bool reset_activehigh):
ESP8266WebServer(addr, port),
_reset_pin(reset_pin),
_reset_state(reset_state),
_spi_freq(spi_freq),
_reset_activehigh(reset_activehigh),
_state(HTTP_AVRISP_STATE_IDLE),
_currentBodyIndex(0),
_bodyLen(0)
{
	pinMode(_reset_pin, OUTPUT);
    setReset(_reset_state);
	RegisterAVRISP();
}

ESP8266AVRISPWebServer::ESP8266AVRISPWebServer(int port, uint8_t reset_pin, uint32_t spi_freq, bool reset_state, bool reset_activehigh):
ESP8266WebServer(port),
_reset_pin(reset_pin),
_reset_state(reset_state),
_spi_freq(spi_freq),
_reset_activehigh(reset_activehigh),
_state(HTTP_AVRISP_STATE_IDLE),
_currentBodyIndex(0),
_bodyLen(0)
{
	pinMode(_reset_pin, OUTPUT);
    setReset(_reset_state);
	RegisterAVRISP();
}

void ESP8266AVRISPWebServer::handleClient2()
{
	if (_currentStatus == HC_NONE) {
    WiFiClient client = _server.available();
    if (!client) {
      return;
    }

#ifdef DEBUG_ESP_HTTP_SERVER
    DEBUG_OUTPUT.println("New client");
#endif

    _currentClient = client;
    _currentStatus = HC_WAIT_READ;
    _statusChange = millis();
  }

  if (!_currentClient.connected()) {
    _currentClient = WiFiClient();
    _currentStatus = HC_NONE;
    return;
  }

  // Wait for data from client to become available
  if (_currentStatus == HC_WAIT_READ) {
    if (!_currentClient.available()) {
      if (millis() - _statusChange > HTTP_MAX_DATA_WAIT) {
        _currentClient = WiFiClient();
        _currentStatus = HC_NONE;
      }
      yield();
      return;
    }

    if (!_parseRequest2(_currentClient)) {
      _currentClient = WiFiClient();
      _currentStatus = HC_NONE;
      return;
    }

    _contentLength = CONTENT_LENGTH_NOT_SET;
    _handleRequest();

    if (!_currentClient.connected()) {
      _currentClient = WiFiClient();
      _currentStatus = HC_NONE;
      return;
    } else {
      _currentStatus = HC_WAIT_CLOSE;
      _statusChange = millis();
      return;
    }
  }

  if (_currentStatus == HC_WAIT_CLOSE) {
    if (millis() - _statusChange > HTTP_MAX_CLOSE_WAIT) {
      _currentClient = WiFiClient();
      _currentStatus = HC_NONE;
    } else {
      yield();
      return;
    }
  }
}

bool ESP8266AVRISPWebServer::_parseRequest2(WiFiClient& client) {
  // Read the first line of HTTP request
  String req = client.readStringUntil('\r');
  client.readStringUntil('\n');
#ifdef HTTP_ESPAVRISP_DEBUG
  Serial.println(req);
#endif
  //reset header value
  for (int i = 0; i < _headerKeysCount; ++i) {
    _currentHeaders[i].value =String();
   }

  // First line of HTTP request looks like "GET /path HTTP/1.1"
  // Retrieve the "/path" part by finding the spaces
  int addr_start = req.indexOf(' ');
  int addr_end = req.indexOf(' ', addr_start + 1);
  if (addr_start == -1 || addr_end == -1) {
#ifdef DEBUG_ESP_HTTP_SERVER
    DEBUG_OUTPUT.print("Invalid request: ");
    DEBUG_OUTPUT.println(req);
#endif
    return false;
  }

  String methodStr = req.substring(0, addr_start);
  String url = req.substring(addr_start + 1, addr_end);
  String searchStr = "";
  int hasSearch = url.indexOf('?');
  if (hasSearch != -1){
    searchStr = url.substring(hasSearch + 1);
    url = url.substring(0, hasSearch);
  }
  _currentUri = url;

  HTTPMethod method = HTTP_GET;
  if (methodStr == "POST") {
    method = HTTP_POST;
  } else if (methodStr == "DELETE") {
    method = HTTP_DELETE;
  } else if (methodStr == "OPTIONS") {
    method = HTTP_OPTIONS;
  } else if (methodStr == "PUT") {
    method = HTTP_PUT;
  } else if (methodStr == "PATCH") {
    method = HTTP_PATCH;
  }
  _currentMethod = method;

