longpth/HTTP_ESP8266AVRISP/src/ESP8266AVRISPWebServer.cpp
#ifdef DEBUG_ESP_HTTP_SERVER
  DEBUG_OUTPUT.print("method: ");
  DEBUG_OUTPUT.print(methodStr);
  DEBUG_OUTPUT.print(" url: ");
  DEBUG_OUTPUT.print(url);
  DEBUG_OUTPUT.print(" search: ");
  DEBUG_OUTPUT.println(searchStr);
#endif

  //attach handler
  RequestHandler* handler;
  for (handler = _firstHandler; handler; handler = handler->next()) {
    if (handler->canHandle(_currentMethod, _currentUri))
      break;
  }
  _currentHandler = handler;

  String formData;
  // below is needed only when POST type request
  if (method == HTTP_POST || method == HTTP_PUT || method == HTTP_PATCH || method == HTTP_DELETE){
    String boundaryStr;
    String headerName;
    String headerValue;
    bool isForm = false;
    uint32_t contentLength = 0;
    //parse headers
    while(1){
      req = client.readStringUntil('\r');
      client.readStringUntil('\n');
#ifdef DEBUG_ESP_HTTP_SERVER
	  Serial.println(req);
#endif
      if (req == "") break;//no moar headers
      int headerDiv = req.indexOf(':');
      if (headerDiv == -1){
        break;
      }
      headerName = req.substring(0, headerDiv);
      headerValue = req.substring(headerDiv + 1);
      headerValue.trim();
       _collectHeader(headerName.c_str(),headerValue.c_str());

	  #ifdef DEBUG_ESP_HTTP_SERVER
	  DEBUG_OUTPUT.print("headerName: ");
	  DEBUG_OUTPUT.println(headerName);
	  DEBUG_OUTPUT.print("headerValue: ");
	  DEBUG_OUTPUT.println(headerValue);
	  #endif

      if (headerName == "Content-Type"){
        if (headerValue.startsWith("text/plain")){
          isForm = false;
        } else if (headerValue.startsWith("multipart/form-data")){
          boundaryStr = headerValue.substring(headerValue.indexOf('=')+1);
          isForm = true;
        }
      } else if (headerName == "Content-Length"){
        contentLength = headerValue.toInt();
      } else if (headerName == "Host"){
        _hostHeader = headerValue;
      }
    }

    if (!isForm){
      size_t plainLength;
      char* plainBuf = readBytesWithTimeout2(client, contentLength, plainLength, HTTP_MAX_POST_WAIT);
      if (plainLength < contentLength) {
      	free(plainBuf);
      	return false;
      }
#ifdef DEBUG_ESP_HTTP_SERVER
	  Serial.println("body data length: ");
	  Serial.println(plainLength);
	  Serial.println("method: ");
	  Serial.println(_currentMethod);
	  Serial.println("uri: ");
	  Serial.println(_currentUri);
#endif
	  for(byte i = 0; i < plainLength; ++i){
		  _body[i] = plainBuf[i];
		  Serial.print("Body data: ");
		  Serial.print(i);
		  Serial.print(" ");
		  Serial.println((int)_body[i], HEX);
	  }
	  _bodyLen = plainLength;
#ifdef DEBUG_ESP_HTTP_SERVER
      DEBUG_OUTPUT.print("Plain: ");
      DEBUG_OUTPUT.println(plainBuf);
#endif
      if (contentLength > 0) {
        if (searchStr != "") searchStr += '&';
        if(plainBuf[0] == '{' || plainBuf[0] == '[' || strstr(plainBuf, "=") == NULL){
          //plain post json or other data
          searchStr += "plain=";
          searchStr += plainBuf;
        } else {
          searchStr += plainBuf;
        }
        free(plainBuf);
      }
    }
    _parseArguments(searchStr);
    if (isForm){
      if (!_parseForm(client, boundaryStr, contentLength)) {
        return false;
      }
    }
  } else {
    String headerName;
    String headerValue;
    //parse headers
    while(1){
      req = client.readStringUntil('\r');
      client.readStringUntil('\n');
#ifdef DEBUG_ESP_HTTP_SERVER
	  Serial.println(req);
#endif
      if (req == "") break;//no moar headers
      int headerDiv = req.indexOf(':');
      if (headerDiv == -1){
        break;
      }
      headerName = req.substring(0, headerDiv);
      headerValue = req.substring(headerDiv + 2);
      _collectHeader(headerName.c_str(),headerValue.c_str());

	  #ifdef DEBUG_ESP_HTTP_SERVER
	  DEBUG_OUTPUT.print("headerName: ");
	  DEBUG_OUTPUT.println(headerName);
	  DEBUG_OUTPUT.print("headerValue: ");
	  DEBUG_OUTPUT.println(headerValue);
	  #endif

	  if (headerName == "Host"){
        _hostHeader = headerValue;
      }
    }
    _parseArguments(searchStr);
  }
  client.flush();

#ifdef DEBUG_ESP_HTTP_SERVER
  DEBUG_OUTPUT.print("Request: ");
  DEBUG_OUTPUT.println(url);
  DEBUG_OUTPUT.print(" Arguments: ");
  DEBUG_OUTPUT.println(searchStr);
#endif

  return true;
}

void ESP8266AVRISPWebServer::setSpiFrequency(uint32_t freq) {
    _spi_freq = freq;
    if (_state == HTTP_AVRISP_STATE_ACTIVE) {
        SPI.setFrequency(freq);
    }
}

void ESP8266AVRISPWebServer::RegisterAVRISP()
{
	on("/cmd", HTTP_POST, [this]{ avrisp(); });
}

void ESP8266AVRISPWebServer::setReset(bool rst) {
    _reset_state = rst;
    digitalWrite(_reset_pin, _resetLevel(_reset_state));
}

HTTPAVRISPState_t ESP8266AVRISPWebServer::update() {
    switch (_state) {
        case HTTP_AVRISP_STATE_IDLE: {
            if (_server.hasClient()) {
                _client = _server.available();
                _client.setNoDelay(true);
                ip_addr_t lip;
                lip.addr = _client.remoteIP();
                AVRISP_DEBUG("client connect %d.%d.%d.%d:%d", IP2STR(&lip), _client.remotePort());
                _client.setTimeout(100); // for getch()
                _state = HTTP_AVRISP_STATE_PENDING;
                _reject_incoming();
            }
            break;
        }
        case HTTP_AVRISP_STATE_PENDING:
        case HTTP_AVRISP_STATE_ACTIVE: {
            // handle disconnect
            if (!_client.connected()) {
                _client.stop();
                AVRISP_DEBUG("client disconnect");
                if (pmode) {
                    SPI.end();
                    pmode = 0;
                }
                setReset(_reset_state);
                _state = HTTP_AVRISP_STATE_IDLE;
            } else {
                _reject_incoming();
            }
            break;
        }
    }
    return _state;
}

HTTPAVRISPState_t ESP8266AVRISPWebServer::serve() {
    switch (update()) {
        case HTTP_AVRISP_STATE_IDLE:
            // should not be called when idle, error?
            break;
        case HTTP_AVRISP_STATE_PENDING: {
            _state = HTTP_AVRISP_STATE_ACTIVE;
        // fallthrough
        }
        case HTTP_AVRISP_STATE_ACTIVE: {
            while (_client.available()) {
                avrisp();
            }
            return update();
        }
    }
    return _state;
}

inline void ESP8266AVRISPWebServer::_reject_incoming(void) {
    while (_server.hasClient()) _server.available().stop();
}

uint8_t ESP8266AVRISPWebServer::getch() {
#if 0
    while (!_client.available()) yield();
    uint8_t b = (uint8_t)_client.read();
#endif
    uint8_t b = _body[_currentBodyIndex++];
    // AVRISP_DEBUG("< %02x", b);
    return b;
}

