longpth/HTTP_ESP8266AVRISP/src/ESP8266AVRISPWebServer.cpp
void ESP8266AVRISPWebServer::fill(int n) {
    // AVRISP_DEBUG("fill(%u)", n);
    for (int x = 0; x < n; x++) {
        buff[x] = getch();
    }
}

uint8_t ESP8266AVRISPWebServer::spi_transaction(uint8_t a, uint8_t b, uint8_t c, uint8_t d) {
    uint8_t n;
    SPI.transfer(a);
    n = SPI.transfer(b);
    n = SPI.transfer(c);
    return SPI.transfer(d);
}

void ESP8266AVRISPWebServer::empty_reply() {
	char resp[2];
    if (Sync_CRC_EOP == getch()) {
    	resp[0] = Resp_STK_INSYNC;
    	resp[1] = Resp_STK_OK;
        //_client.print((char)Resp_STK_INSYNC);
        //_client.print((char)Resp_STK_OK);
    	send_P(200, "text/plain", (const char *)resp, 2);
    } else {
        error++;
    	resp[0] = Resp_STK_NOSYNC;
    	resp[1] = Resp_STK_OK;
        //_client.print((char)Resp_STK_NOSYNC);
    	send_P(200, "text/plain", (const char *)resp, 2);
    }
}

void ESP8266AVRISPWebServer::breply(uint8_t b) {
    uint8_t resp[3];
    if (Sync_CRC_EOP == getch()) {
        resp[0] = Resp_STK_INSYNC;
        resp[1] = b;
        resp[2] = Resp_STK_OK;
        //_client.write((const uint8_t *)resp, (size_t)3);
        send_P(200, "text/plain", (const char *)resp, 3);
    } else {
        error++;
        //_client.print((char)Resp_STK_NOSYNC);
        resp[0] = Resp_STK_NOSYNC;
        resp[1] = b;
        resp[2] = Resp_STK_OK;
        send_P(200, "text/plain", (const char *)resp, 3);
    }

}

void ESP8266AVRISPWebServer::get_parameter(uint8_t c) {
    switch (c) {
    case 0x80:
        breply(AVRISP_HWVER);
        break;
    case 0x81:
        breply(AVRISP_SWMAJ);
        break;
    case 0x82:
        breply(AVRISP_SWMIN);
        break;
    case 0x93:
        breply('S'); // serial programmer
        break;
    default:
        breply(0);
    }
}

void ESP8266AVRISPWebServer::set_parameters() {
    // call this after reading paramter packet into buff[]
    param.devicecode = buff[0];
    param.revision   = buff[1];
    param.progtype   = buff[2];
    param.parmode    = buff[3];
    param.polling    = buff[4];
    param.selftimed  = buff[5];
    param.lockbytes  = buff[6];
    param.fusebytes  = buff[7];
    param.flashpoll  = buff[8];
    // ignore buff[9] (= buff[8])
    // following are 16 bits (big endian)
    param.eeprompoll = beget16(&buff[10]);
    param.pagesize   = beget16(&buff[12]);
    param.eepromsize = beget16(&buff[14]);

    // 32 bits flashsize (big endian)
    param.flashsize = buff[16] * 0x01000000
                    + buff[17] * 0x00010000
                    + buff[18] * 0x00000100
                    + buff[19];
}

void ESP8266AVRISPWebServer::start_pmode() {
    SPI.begin();
    SPI.setFrequency(_spi_freq);
    SPI.setHwCs(false);

    // try to sync the bus
    SPI.transfer(0x00);
    digitalWrite(_reset_pin, _resetLevel(false));
    delayMicroseconds(50);
    digitalWrite(_reset_pin, _resetLevel(true));
    delay(30);

    spi_transaction(0xAC, 0x53, 0x00, 0x00);
    pmode = 1;
}

void ESP8266AVRISPWebServer::end_pmode() {
    SPI.end();
    setReset(_reset_state);
    pmode = 0;
}

void ESP8266AVRISPWebServer::universal() {
    int w;
    uint8_t ch;

    fill(4);
    ch = spi_transaction(buff[0], buff[1], buff[2], buff[3]);
    breply(ch);
}

void ESP8266AVRISPWebServer::flash(uint8_t hilo, int addr, uint8_t data) {
    spi_transaction(0x40 + 8 * hilo,
                    addr >> 8 & 0xFF,
                    addr & 0xFF,
                    data);
}

void ESP8266AVRISPWebServer::commit(int addr) {
    spi_transaction(0x4C, (addr >> 8) & 0xFF, addr & 0xFF, 0);
    delay(AVRISP_PTIME);
}

//#define _addr_page(x) (here & 0xFFFFE0)
int ESP8266AVRISPWebServer::addr_page(int addr) {
    if (param.pagesize == 32)  return addr & 0xFFFFFFF0;
    if (param.pagesize == 64)  return addr & 0xFFFFFFE0;
    if (param.pagesize == 128) return addr & 0xFFFFFFC0;
    if (param.pagesize == 256) return addr & 0xFFFFFF80;
    AVRISP_DEBUG("unknown page size: %d", param.pagesize);
    return addr;
}


void ESP8266AVRISPWebServer::write_flash(int length) {
    uint32_t started = millis();

    fill(length);
	
	uint8_t resp[2];

    if (Sync_CRC_EOP == getch()) {
        //_client.print((char) Resp_STK_INSYNC);
        //_client.print((char) write_flash_pages(length));
		resp[0] = Resp_STK_INSYNC;
		resp[1] = write_flash_pages(length);
		send_P(200, "text/plain", (const char *)resp, 2);
    } else {
      error++;
      //_client.print((char) Resp_STK_NOSYNC);
	  resp[0] = Resp_STK_NOSYNC;
	  send_P(200, "text/plain", (const char *)resp, 1);
    }
}

uint8_t ESP8266AVRISPWebServer::write_flash_pages(int length) {
    int x = 0;
    int page = addr_page(here);
    while (x < length) {
        yield();
        if (page != addr_page(here)) {
            commit(page);
            page = addr_page(here);
        }
        flash(LOW, here, buff[x++]);
        flash(HIGH, here, buff[x++]);
        here++;
    }
    commit(page);
    return Resp_STK_OK;
}

uint8_t ESP8266AVRISPWebServer::write_eeprom(int length) {
    // here is a word address, get the byte address
    int start = here * 2;
    int remaining = length;
    if (length > param.eepromsize) {
        error++;
        return Resp_STK_FAILED;
    }
    while (remaining > EECHUNK) {
        write_eeprom_chunk(start, EECHUNK);
        start += EECHUNK;
        remaining -= EECHUNK;
    }
    write_eeprom_chunk(start, remaining);
    return Resp_STK_OK;
}
// write (length) bytes, (start) is a byte address
uint8_t ESP8266AVRISPWebServer::write_eeprom_chunk(int start, int length) {
    // this writes byte-by-byte,
    // page writing may be faster (4 bytes at a time)
    fill(length);
    // prog_lamp(LOW);
    for (int x = 0; x < length; x++) {
        int addr = start + x;
        spi_transaction(0xC0, (addr >> 8) & 0xFF, addr & 0xFF, buff[x]);
        delay(45);
    }
    // prog_lamp(HIGH);
    return Resp_STK_OK;
}

void ESP8266AVRISPWebServer::program_page() {
    char result = (char) Resp_STK_FAILED;
    int length = 256 * getch();
    length += getch();
    char memtype = getch();
    char buf[100];
    // flash memory @here, (length) bytes
    if (memtype == 'F') {
        write_flash(length);
        return;
    }

	uint8_t resp[2];
    if (memtype == 'E') {
        result = (char)write_eeprom(length);
        if (Sync_CRC_EOP == getch()) {
            //_client.print((char) Resp_STK_INSYNC);
            //_client.print(result);
			resp[0] = Resp_STK_INSYNC;
			resp[1] = result;
			send_P(200, "text/plain", (const char *)resp, 2);
        } else {
            error++;
            //_client.print((char) Resp_STK_NOSYNC);
			resp[0] = Resp_STK_NOSYNC;
			send_P(200, "text/plain", (const char *)resp, 1);
        }
        return;
    }
    //_client.print((char)Resp_STK_FAILED);
	resp[0] = Resp_STK_NOSYNC;
	send_P(200, "text/plain", (const char *)resp, 1);
	return;

