longpth/HTTP_ESP8266AVRISP/src/ESP8266AVRISPWebServer.cpp
}

uint8_t ESP8266AVRISPWebServer::flash_read(uint8_t hilo, int addr) {
    return spi_transaction(0x20 + hilo * 8,
                           (addr >> 8) & 0xFF,
                           addr & 0xFF,
                           0);
}

void ESP8266AVRISPWebServer::flash_read_page(int length, uint8_t* data) {
    //uint8_t *data = (uint8_t *) malloc(length + 1);
    for (int x = 0; x < length; x += 2) {
        *(data + x) = flash_read(LOW, here);
        *(data + x + 1) = flash_read(HIGH, here);
        here++;
    }
    *(data + length) = Resp_STK_OK;
    //_client.write((const uint8_t *)data, (size_t)(length + 1));
    //free(data);
    return;
}

void ESP8266AVRISPWebServer::eeprom_read_page(int length) {
    // here again we have a word address
    uint8_t *data = (uint8_t *) malloc(length + 1);
    int start = here * 2;
    for (int x = 0; x < length; x++) {
        int addr = start + x;
        uint8_t ee = spi_transaction(0xA0, (addr >> 8) & 0xFF, addr & 0xFF, 0xFF);
        *(data + x) = ee;
    }
    *(data + length) = Resp_STK_OK;
    _client.write((const uint8_t *)data, (size_t)(length + 1));
    free(data);
    return;
}

void ESP8266AVRISPWebServer::read_page() {
    char result = (char)Resp_STK_FAILED;
    int length = 256 * getch();
    length += getch();
    char memtype = getch();
	uint8_t *data = (uint8_t *) malloc(length + 2);
    if (Sync_CRC_EOP != getch()) {
        error++;
        //_client.print((char) Resp_STK_NOSYNC);
		*data = Resp_STK_NOSYNC;
		send_P(200, "text/plain", (const char *)data, 1);
		free(data);
        return;
    }
    //_client.print((char) Resp_STK_INSYNC);
	*data = Resp_STK_INSYNC;
    if (memtype == 'F'){
		flash_read_page(length,data+1);
		send_P(200, "text/plain", (const char *)data, length + 2);
	}
    if (memtype == 'E') eeprom_read_page(length);
	free(data);
    return;
}

void ESP8266AVRISPWebServer::read_signature() {
	uint8_t resp[5];
    if (Sync_CRC_EOP != getch()) {
        error++;
        //_client.print((char) Resp_STK_NOSYNC);
		resp[0] = Resp_STK_NOSYNC;
		send_P(200, "text/plain", (const char *)resp, 1);
        return;
    }
    //_client.print((char) Resp_STK_INSYNC);
    uint8_t high = spi_transaction(0x30, 0x00, 0x00, 0x00);
    //_client.print((char) high);
    uint8_t middle = spi_transaction(0x30, 0x00, 0x01, 0x00);
    //_client.print((char) middle);
    uint8_t low = spi_transaction(0x30, 0x00, 0x02, 0x00);
    //_client.print((char) low);
    //_client.print((char) Resp_STK_OK);
	resp[0] = Resp_STK_INSYNC;
	resp[1] = high;
	resp[2] = middle;
	resp[3] = low;
	resp[4] = Resp_STK_OK;
	send_P(200, "text/plain", (const char*)resp, 5);
	Serial.print("read_signature: ");
	Serial.println((const char*)resp);
}

// It seems ArduinoISP is based on the original STK500 (not v2)
// but implements only a subset of the commands.
int ESP8266AVRISPWebServer::avrisp() {
#ifdef HTTP_ESPAVRISP_DEBUG
	Serial.print("_currentBodyIndex: ");
	Serial.println(_currentBodyIndex);
#endif
    uint8_t data, low, high;
    uint8_t ch = getch();
	char resp[9];
#ifdef HTTP_ESPAVRISP_DEBUG
    std::map<uint8_t,char*>::iterator it = cmd_debug.find(ch);
    if (it != cmd_debug.end()){
    	Serial.print("Command: ");
		Serial.println(cmd_debug[ch]);
    }
#endif
    // AVRISP_DEBUG("CMD 0x%02x", ch);
    switch (ch) {
    case Cmnd_STK_GET_SYNC:
        error = 0;
        empty_reply();
        break;

    case Cmnd_STK_GET_SIGN_ON:
        if (getch() == Sync_CRC_EOP) {
            //_client.print((char) Resp_STK_INSYNC);
            //_client.print(F("AVR ISP")); // AVR061 says "AVR STK"?
            //_client.print((char) Resp_STK_OK);
			resp[0] = Resp_STK_INSYNC;
			resp[1] = 'A';
			resp[2] = 'V';
			resp[3] = 'R';
			resp[4] = ' ';
			resp[5] = 'I';
			resp[6] = 'S';
			resp[7] = 'P';
			resp[8] = Resp_STK_INSYNC;
			send_P(200, "text/plain", resp, 9);
        }
        break;

    case Cmnd_STK_GET_PARAMETER:
        get_parameter(getch());
        break;

    case Cmnd_STK_SET_DEVICE:
        fill(20);
        set_parameters();
        empty_reply();
        break;

    case Cmnd_STK_SET_DEVICE_EXT:   // ignored
        fill(5);
        empty_reply();
        break;

    case Cmnd_STK_ENTER_PROGMODE:
        start_pmode();
        empty_reply();
        break;

    case Cmnd_STK_LOAD_ADDRESS:
        here = getch();
        here += 256 * getch();
        // AVRISP_DEBUG("here=0x%04x", here);
        empty_reply();
        break;

    // XXX: not implemented!
    case Cmnd_STK_PROG_FLASH:
        low = getch();
        high = getch();
        empty_reply();
        break;

    // XXX: not implemented!
    case Cmnd_STK_PROG_DATA:
        data = getch();
        empty_reply();
        break;

    case Cmnd_STK_PROG_PAGE:
        program_page();
        break;

    case Cmnd_STK_READ_PAGE:
        read_page();
        break;

    case Cmnd_STK_UNIVERSAL:
        universal();
        break;

    case Cmnd_STK_LEAVE_PROGMODE:
        error = 0;
        end_pmode();
        empty_reply();
        delay(5);
        // if (_client && _client.connected())
        //_client.stop();
        // AVRISP_DEBUG("left progmode");
		setReset(false);
        break;

    case Cmnd_STK_READ_SIGN:
        read_signature();
        break;
        // expecting a command, not Sync_CRC_EOP
        // this is how we can get back in sync
    case Sync_CRC_EOP:       // 0x20, space
        error++;
        //_client.print((char) Resp_STK_NOSYNC);
		resp[0] = Resp_STK_NOSYNC;
		send_P(200, "text/plain", (const char *)resp, 1);
        break;

      // anything else we will return STK_UNKNOWN
    default:
        AVRISP_DEBUG("??!?");
        error++;
        if (Sync_CRC_EOP == getch()) {
            //_client.print((char)Resp_STK_UNKNOWN);
			resp[0] = Resp_STK_NOSYNC;
			send_P(200, "text/plain", (const char *)resp, 1);
        } else {
            //_client.print((char)Resp_STK_NOSYNC);
			resp[0] = Resp_STK_NOSYNC;
			send_P(200, "text/plain", (const char *)resp, 1);
        }
  }
  _currentBodyIndex = 0;
}
